# Найдите сумму цифр трехзначного числа n.
# Результат сохраните в перменную res.

n = int(input("Введите трехзначное число: "))
n1 = n
res = 0
for i in range(3):
    res += n % 10
    n //= 10
if n // 1000 == 0 or n // 10 >= 10:
    print(f"n = {n1} -> res = {res} ({n1 // 100} + {n1 // 10 % 10} + {n1 % 10})")
else:
    print("Ошибка! Введенное число не трехзначное!")