# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений 
# в порядке возрастания все те числа, которые встречаются в обоих наборах. На вход подается 2 числа 
# через пробел: n m
# n - кол-во элементов первого множества.
# m - кол-во элементов второго множества.
# Затем подаются элементы каждого множества через пробел в виде строки. ! Писать input() не надо

# var1 = ['5 4']  количество элементов первого и второго множества
# var2 = ['1 3 5 7 9']  элементы первого множества через пробел
# var3 = ['2 3 4 5']  элементы второго множества через пробел
# Вывод: 3 5

var1 = '5 5'
var2 = '10 20 30 40 50'
var3 = '10 20 30 40 50'
var4 = []
res = ""
count = 0
set(var2[0])
set(var3[0])
var2 = var2.split()
var3 = var3.split()
for i in var2:
    for j in var3:
        if i == j and i != " " and j != " ":
            var4.append(i)
for i in var4:
    count += 1
    if count == len(var4):
        res += f"{i}"
    else:
        res += f"{i} "
print(res)