# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.

# В случае с английским алфавитом очки распределяются так:

# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:

# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова k и выводит его. Будем считать, 
# что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

text = input()
text = text.lower()
sum = 0
for i in text:
    if i == "а" or i == "в" or i == "е" or i == "и" or i == "н" or i == "о" or i == "р" or i == "с" or i == "т":
        sum += 1
    if i == "a" or i== "e" or i == "i" or i == "o" or i == "u" or i == "l" or i == "n" or i == "s" or i == "t" or i == "r":
        sum += 1
    if i == "d" or i == "g" or i == "д" or i == "к" or i == "л" or i == "м" or i == "п" or i == "у":
        sum += 2
    if i == "b" or i == "c" or i == "m" or i == "p" or i == "б" or i == "г" or i == "ё" or i == "ь" or i == "я":
        sum += 3
    if i == "f" or i == "h" or i == "v" or i == "w" or i == "y" or i == "й" or i == "ы":
        sum += 4
    if i == "k" or i == "ж" or i == "з" or i == "х" or i == "ц" or i == "ч":
        sum += 5
    if i == "ш" or i == "э" or i == "ю" or i == "j" or i == "x":
        sum += 8
    if i == "q" or i == "z" or i == "ф" or i == "щ" or i == "ъ":
        sum += 10
print(sum)