# Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
# Найдите количество и выведите его.
list1 = [1, 2, 3, 4, 5]
count = 0
k = int(input())
for i in list1:
    if i == k:
        count += 1
print(count)