# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y <= 1000), а Катя должна их отгадать. Для этого Петя делает 
# две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

s = int(input())
p = int(input())
count1 = 0
count2 = 0
tf = 0
if s * p > 1000:
    print("Ошибка!")
while count1 < s:
    while count2 < p:
        if count1 + count2 == s and count1 * count2 == p:
            print(count1)
            print(count2)
            tf += 1
        count2 += 1
    count1 += 1
    if tf == 0:
        count2 = 0