# Напишите функцию f, которая на вход принимает два числа a и b, и возводит число a в целую степень b с помощью рекурсии.
# Функция не должна ничего выводить, только возвращать значение.

a = int(input("Введите число: "))
b = int(input("Введите степень: "))
def f(a, b, a1 = a):
    if b == 1:
        return a
    return f(a * a1, b-1, a1)

print(f(a, b))